export const years = [{ "first": "2000", "last": "2004" }, { "first": "2005", "last": "2009" }, { "first": "2010", "last": "2014" }, { "first": "2015", "last": "2019" }, { "first": "2020", "last": "2024" }, { "first": "2025", "last": "2029" }];

export const topics = ["Первая тема", "Вторая", "Третья", "Четвертая", "Пятая", "Шестая"]
export interface YearInfo {
    year: number;
    info: string;
}
  
export interface YearsData {
    [key: string]: YearInfo[];
}

export const data: YearsData = {
    "20002004": [
    {
        "year": 2000,
        "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
    },
    {
        "year": 2001,
        "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
    },
    {
        "year": 2002,
        "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
    }, 
    {
        "year": 2003,
        "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
    }, 
    {
        "year": 2004,
        "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
    }
    ],
    "20052009": [
        {
            "year": 2005,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2006,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2007,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2008,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2009,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }
    ],
    "20102014": [
        {
            "year": 2010,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2011,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2012,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2013,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2014,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }
    ],
    "20152019": [
        {
            "year": 2015,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2016,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2017,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2018,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2019,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }
    ],
    "20202024": [
        {
            "year": 2020,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2021,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2022,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2023,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2024,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }
    ],
    "20252029": [
        {
            "year": 2025,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2026,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        },
        {
            "year": 2027,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2028,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }, 
        {
            "year": 2029,
            "info": "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды"
        }
    ],
}